Table of Contents
 Class LoadGroupSIA
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load group for SIA
[OpenModelClass("CI.StructModel.Loading.LoadGroupSIA,CI.Loading", "CI.StructModel.Loading.ILoadGroup,CI.BasicTypes", typeof(LoadGroup))]
public class LoadGroupSIA : LoadGroup
Inheritance
object
OpenObject
OpenElementId
LoadGroup
LoadGroupSIA
Inherited Members
 LoadGroup.Name
 LoadGroup.Relation
 LoadGroup.GroupType
 LoadGroup.GammaQ
 LoadGroup.Dzeta
 LoadGroup.GammaGInf
 LoadGroup.GammaGSup
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 LoadGroupSIA()
Constructor
public LoadGroupSIA()
Properties
 Psi0
ψ 0
public double Psi0 { get; set; }
Property Value
double
 Psi1
ψ 1
public double Psi1 { get; set; }
Property Value
double
 Psi2
ψ 2
public double Psi2 { get; set; }
Property Value
double
 Edit this page